---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotGenerate
source: html/0469bae0-09e6-a144-82bd-99e6864d921e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotGenerate Property

Could not create Structural Connection Handler

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionCannotGenerate { get; }
```